const axios = require('axios');

module.exports = {
  name: 'ascii',
  description: 'Convert text to ASCII art',
  author: 'Samir',
  async execute(senderId, args, pageAccessToken, sendMessage, splitMessageIntoChunks) {
    const prompt = args.join(' ').toLowerCase();
    if (!prompt) {
      sendMessage(senderId, { text: 'Please provide text to convert to ASCII' }, pageAccessToken);
      return;
    }

    let text = prompt.replace(/\./g, `
░░░
░░░
░░░
░░░
██╗
╚═╝`)
    .replace(/à|á|ạ|ả|ã|â|ầ|ấ|ậ|ẩ|ẫ|ă|ằ|ắ|ặ|ẳ|ẵ|a/g, `
░█████╗░
██╔══██╗
███████║
██╔══██║
██║░░██║
╚═╝░░╚═╝`)
    .replace(/b/g, `
██████╗░
██╔══██╗
██████╦╝
██╔══██╗
██████╦╝
╚═════╝░`)
    .replace(/c/g, `
░█████╗░
██╔══██╗
██║░░╚═╝
██║░░██╗
╚█████╔╝
░╚════╝░`)
    .replace(/d|đ/g, `
██████╗░
██╔══██╗
██║░░██║
██║░░██║
██████╔╝
╚═════╝░`)
    .replace(/è|é|ẹ|ẻ|ẽ|ê|ề|ế|ệ|ể|ễ|e/g, `
███████╗
██╔════╝
█████╗░░
██╔══╝░░
███████╗
╚══════╝`)
    .replace(/f/g, `
███████╗
██╔════╝
█████╗░░
██╔══╝░░
██║░░░░░
╚═╝░░░░░`)
    .replace(/g/g, `
░██████╗░
██╔════╝░
██║░░██╗░
██║░░╚██╗
╚██████╔╝
░╚═════╝░`)
    .replace(/h/g, `
██╗░░██╗
██║░░██║
███████║
██╔══██║
██║░░██║
╚═╝░░╚═╝`)
    .replace(/i/g, `
██╗
██║
██║
██║
██║
╚═╝`)
    .replace(/ì|í|ị|ỉ|ĩ|i/g, `
░░░░░██╗
░░░░░██║
░░░░░██║
██╗░░██║
╚█████╔╝
░╚════╝░`)
    .replace(/k/g, `
██╗░░██╗
██║░██╔╝
█████═╝░
██╔═██╗░
██║░╚██╗
╚═╝░░╚═╝`)
    .replace(/l/g, `
██╗░░░░░
██║░░░░░
██║░░░░░
██║░░░░░
███████╗
╚══════╝`)
    .replace(/m/g, `
███╗░░░███╗
████╗░████║
██╔████╔██║
██║╚██╔╝██║
██║░╚═╝░██║
╚═╝░░░░░╚═╝`)
    .replace(/n/g, `
███╗░░██╗
████╗░██║
██╔██╗██║
██║╚████║
██║░╚███║
╚═╝░░╚══╝`)
    .replace(/ò|ó|ọ|ỏ|õ|ô|ồ|ố|ộ|ổ|ỗ|ơ|ờ|ớ|ợ|ở|ỡ|o/g, `
░█████╗░
██╔══██╗
██║░░██║
██║░░██║
╚█████╔╝
░╚════╝░`)
    .replace(/p/g, `
██████╗░
██╔══██╗
██████╔╝
██╔═══╝░
██║░░░░░
╚═╝░░░░░`)
    .replace(/q/g, `
░██████╗░
██╔═══██╗
██║██╗██║
╚██████╔╝
░╚═██╔═╝░
░░░╚═╝░░░`)
    .replace(/r/g, `
██████╗░
██╔══██╗
██████╔╝
██╔══██╗
██║░░██║
╚═╝░░╚═╝`)
    .replace(/s/g, `
░██████╗
██╔════╝
╚█████╗░
░╚═══██╗
██████╔╝
╚═════╝░`)
    .replace(/t/g, `
████████╗
╚══██╔══╝
░░░██║░░░
░░░██║░░░
░░░██║░░░
░░░╚═╝░░░`)
    .replace(/ù|ú|ụ|ủ|ũ|ư|ừ|ứ|ự|ử|ữ|u/g, `
██╗░░░██╗
██║░░░██║
██║░░░██║
██║░░░██║
╚██████╔╝
░╚═════╝░`)
    .replace(/v/g, `
██╗░░░██╗
██║░░░██║
╚██╗░██╔╝
░╚████╔╝░
░░╚██╔╝░░
░░░╚═╝░░░`)
    .replace(/x/g, `
██╗░░██╗
╚██╗██╔╝
░╚███╔╝░
░██╔██╗░
██╔╝╚██╗
╚═╝░░╚═╝` )
    .replace(/ỳ|ý|ỵ|ỷ|ỹ|y/g, `
██╗░░░██╗
╚██╗░██╔╝
░╚████╔╝░
░░╚██╔╝░░
░░░██║░░░
░░░╚═╝░░░`)
    .replace(/w/g, `
░██╗░░░░░░░██╗
░██║░░██╗░░██║
░╚██╗████╗██╔╝
░░████╔═████║░
░░╚██╔╝░╚██╔╝░
░░░╚═╝░░░╚═╝░░`)
    .replace(/z/g, `
███████╗
╚════██║
░░███╔═╝
██╔══╝░░
███████╗
╚══════╝`)
    .replace(/\u0300|\u0301|\u0303|\u0309|\u0323/g, "");

    const maxMessageLength = 2000;
    if (text.length > maxMessageLength) {
      const messages = splitMessageIntoChunks(text, maxMessageLength);
      for (const message of messages) {
        sendMessage(senderId, { text: message }, pageAccessToken);
      }
    } else {
      sendMessage(senderId, { text }, pageAccessToken);
    }
  }
};
